package org.example.test0710;

public class 자바기초이론문제 {
/*



Q1. (D) private.

Q2. // (C) static 메서드 내에서는 this 키워드를 사용할 수 있다.

Q3. (D) 외부 클래스의 인스턴스 없이도 생성 가능하다.

Q4. (B) final 메서드는 하위 클래스에서 오버라이딩할 수 있다.

Q5. (B) 자신의 클래스 내 다른 생성자를 호출할 때 사용할 수 있다.

Q6. (C) 오버로딩은 같은 클래스 내에서 메서드 이름은 같지만 매개변수가 달라야 한다.

Q7. (C) 추상 메서드를 포함할 수 있다.

Q8. (C) 인터페이스는 오직 추상 메서드만 가질 수 있다 (Java 8 이전 기준).

Q9. (D) class C가 interface를 상속하려 할 때 발생

Q10. (D) catch 블록보다 먼저 실행된다.

Q11. 2

Q12. String name을 안써야 함. // sound() 메서드를 오버라이딩 하지 않았기때문에
     컴파일 에러 발생.













 */

}

